; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	image1 - mode
	thermograph0 - mode
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star1 - direction
	GroundStation2 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 thermograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument6 image1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star1)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument7 thermograph0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
)
(:goal (and
	(have_image Star5 image1)
	(have_image Star6 thermograph0)
	(have_image Phenomenon7 image1)
	(have_image Star9 image1)
	(have_image Phenomenon11 image1)
))

)

; plan
1. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 5
2. (calibrate satellite2 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 0 of 5
3. (turn_to satellite2 star5 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 star5)
   goals met: 0 of 5
4. (take_image satellite2 star5 instrument6 image1)
   added: (have_image star5 image1)
   goals met: 1 of 5
5. (turn_to satellite2 phenomenon7 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 phenomenon7)
   goals met: 1 of 5
6. (take_image satellite2 phenomenon7 instrument6 image1)
   added: (have_image phenomenon7 image1)
   goals met: 2 of 5
7. (turn_to satellite2 phenomenon11 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon11)
   goals met: 2 of 5
8. (take_image satellite2 phenomenon11 instrument6 image1)
   added: (have_image phenomenon11 image1)
   goals met: 3 of 5
9. (turn_to satellite2 star6 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star6)
   goals met: 3 of 5
10. (take_image satellite2 star6 instrument6 thermograph0)
   added: (have_image star6 thermograph0)
   goals met: 4 of 5
11. (turn_to satellite2 star9 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star9)
   goals met: 4 of 5
12. (take_image satellite2 star9 instrument6 image1)
   added: (have_image star9 image1)
   goals met: 5 of 5
